# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap "homebrew/core"
tap 'blackfireio/homebrew-blackfire'
tap 'snyk/tap'
tap 'ringohub/redis-cli'
tap 'symfony-cli/homebrew-tap'
tap 'redis-stack/redis-stack-redisinsight'

# Set arguments for all 'brew cask install' commands
cask_args appdir: "/Applications"

# 'brew install'
brew 'act'
brew 'ansible'
brew 'coreutils'
brew 'docker'
brew 'docker-slim'
brew 'ffmpeg'
brew 'gcc'
brew 'git-filter-repo'
brew 'gpg'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'mas'
brew 'ncdu'
brew 'nmap'
brew 'prettier'
brew 'pv'
brew 'redis-cli'
brew 'ssh-copy-id'
brew 'terraform'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'vegeta'
brew 'whalebrew'
brew 'wget'
brew 'wrk'
brew 'youtube-dl'
brew 'z'
 
# DEV
brew 'composer'
brew 'php@8.2'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phpstan'

brew 'node'
brew 'typescript'

# Docker
brew 'snyk'
brew 'hadolint'

# GIT
brew 'tig'
brew 'gh'
brew 'git'
cask 'git-it'
brew 'git-standup'
brew 'gti'
brew 'gitui'

# 'brew cask install'
# cask '1password'
cask '8bitdo-ultimate-software'
cask 'another-redis-desktop-manager'
cask 'bitwarden'
cask 'brave-browser'
cask 'coconutbattery'
cask 'docker'
cask 'drawio'
cask 'dropbox'
cask 'fantastical'
cask 'fig'
cask 'google-chrome'
cask 'google-drive'
cask 'google-cloud-sdk'
cask 'httpie'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'microsoft-office'
# cask 'mysqlworkbench'
cask 'obsidian'
cask 'onyx'
cask 'pdfsam-basic'
cask 'pdfshaver'
cask 'pgadmin4'
cask 'phpstorm'
cask 'postman'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'

# Drivers
cask 'synologyassistant'
# cask 'xbox360-controller-driver-unofficial'

# Mac AppStore
mas 'Sequel Ace', id: 1518036000
mas 'Telegram', id: 747648890
# mas 'Twitterific', id: 1289378661

# 'whalebrew install'
# whalebrew "whalebrew/wget"
