# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap "homebrew/core"
tap 'blackfireio/homebrew-blackfire'
tap 'snyk/tap'

# Set arguments for all 'brew cask install' commands
cask_args appdir: "/Applications"

# 'brew install'
brew 'ansible'
brew 'coreutils'
brew 'ffmpeg'
brew 'gcc'
brew 'gpg'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'mysql'
brew 'mas'
brew 'ncdu'
brew 'nmap'
brew 'prettier'
brew 'pv'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'tldr'
brew 'tmux'
brew 'vegeta'
brew 'whalebrew'
brew 'wget'
brew 'wrk'
brew 'youtube-dl'
brew 'z'
 
# DEV
brew 'blackfire-php74'
brew 'composer'
brew 'php@7.4'
brew 'php@8.0'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phpstan'

brew 'deno'
brew 'node'
brew 'typescript'

brew 'yarn'

# Docker
brew 'snyk'
brew 'hadolint'

# GIT
brew 'tig'
brew 'gh'
brew 'git'
cask 'git-it'
brew 'git-standup'
brew 'gti'

# 'brew cask install'
cask '1password'
cask '8bitdo-ultimate-software'
cask 'another-redis-desktop-manager'
cask 'brave-browser'
cask 'coconutbattery'
cask 'deepl'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2-beta'
cask 'microsoft-office'
cask 'mysqlworkbench'
cask 'runjs'
cask 'onyx'
cask 'pdfsam-basic'
cask 'pdfshaver'
cask 'phpstorm'
cask 'postman'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'the-unarchiver'
cask 'vlc'
cask 'visual-studio-code'

# Drivers
cask '8bitdo-firmware-updater'
cask 'synologyassistant'
cask 'xbox360-controller-driver-unofficial'

# Mac AppStore
mas 'Sequel Ace', id: 1518036000
mas 'Telegram', id: 747648890
mas 'Twitterific', id: 1289378661

# 'whalebrew install'
# whalebrew "whalebrew/wget"
