# Taps
tap 'symfony-cli/homebrew-tap'
tap 'hashicorp/tap'

# Set arguments for all 'brew cask install' commands
cask_args appdir: "/Applications"

# 'brew install'
brew 'act'
brew 'ansible'
brew 'btop'
brew 'coreutils'
brew 'docker'
brew 'ffmpeg'
brew 'fzf'
brew 'gcc'
brew 'git-filter-repo'
brew 'gpg'
brew 'htop'
brew 'jq'
brew 'mas'
brew 'mole'
brew 'ncdu'
brew 'nmap'
brew 'ollama'
brew 'pv'
brew 'redis'
brew 'ssh-copy-id'
brew 'hashicorp/tap/terraform'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'vegeta'
brew 'fzf'
brew 'wget'
brew 'wrk'
brew 'yt-dlp'
 
# DEV
brew 'composer'
brew 'php@8.4'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phpstan'

brew 'node'
brew 'typescript'

# Docker
brew 'snyk-agent-scan'
brew 'hadolint'

# GIT
brew 'tig'
brew 'gh'
brew 'git'
#cask 'git-it'
brew 'git-standup'
brew 'gti'
brew 'gitui'

# 'brew cask install'
# cask '8bitdo-ultimate-software'
cask 'another-redis-desktop-manager'
cask 'bitwarden'
cask 'brave-browser'
cask 'bruno'
cask 'coconutbattery'
cask 'dbgate'
cask 'docker-desktop'
cask 'drawio'
cask 'fantastical'
cask 'google-chrome'
cask 'google-drive'
cask 'gcloud-cli'
cask 'handy'
cask 'imageoptim'
cask 'iterm2'
cask 'microsoft-outlook'
cask 'mongodb-compass'
cask 'obsidian'
cask 'ollama-app'
cask 'onlyoffice'
cask 'onyx'
cask 'pdfsam-basic'
cask 'phpstorm'
cask 'qlmarkdown'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'

# Drivers
cask 'synologyassistant'
# cask 'xbox360-controller-driver-unofficial'

# Mac AppStore
mas 'Sequel Ace', id: 1518036000
mas 'Telegram', id: 747648890

# 'whalebrew install'
# whalebrew "whalebrew/wget"
